source/org_posts/2014-10-09-enums-and-queries-in-rails-4-dot-1.org
#+BEGIN_HTML
---
layout: post
title: "Enums and Queries in Rails 4.1, and Understanding Ruby"
date: 2014-10-22 19:23:02 -1000
comments: true
categories: [rails]
keywords: Ruby on Rails, Enums, Ruby
description: Understanding Ruby and how enums work in Rails 4.1.
canonical: https://hackhands.com/ruby-on-enums-queries-and-rails-4-1/
---
#+END_HTML

Sometimes when you get puzzled by what Rails is doing, you really just to
understand what Ruby is doing.

For example, given this simple code to get an attribute value:

#+BEGIN_SRC ruby
  # return value of some_attribute and foobar
  def some_attribute_foobar
    "#{some_attribute} and foobar"
  end
#+END_SRC

Beginners are often stumped by why this code does not set an attribute value:
#+BEGIN_SRC ruby
  # change the value of some_attribute to foobar
  def change_some_attribute
    # why doesn't the next line set the some_attribute value to "foobar"?
    some_attribute = "foobar"
    save!
  end
#+END_SRC

What's going on?

In the first method, =some_attribute= is actually a method call which gets the
attribute value of the record. This works in Rails ActiveRecord due to the Ruby
feature of [[http://www.ruby-doc.org/core-2.1.3/BasicObject.html][method_missing]] which allows some code to run when a method is called
that does not exist.

In the second method, a local variable called some_attribute is getting
assigned. There is no call to method_missing, as this is a variable assignment!

The correct code should have been:
#+BEGIN_SRC ruby
# change the value of some_attribute to foobar
def change_some_attribute
  self.some_attribute = "foobar"
  save!
end
#+END_SRC

In this case, we're calling the method =some_attribute== on the model instance,
and we get the expected result of assigning an attribute value.

* Enums 

For those not familiar with enums:

#+begin_quote
An enum type is a special data type that enables for a variable to be a set of
predefined constants. The variable must be equal to one of the values that have
been predefined for it.
#+end_quote

Enums, introduced in Rails 4.1, are a place a lot of Ruby magic happens! It's
critical to understand Ruby well in order to understand how to use enums
effectively. Let's suppose we have this simple example, copied over from the
[[http://edgeapi.rubyonrails.org/classes/ActiveRecord/Enum.html][Rails docs]]:

#+BEGIN_SRC ruby
class Conversation < ActiveRecord::Base
  enum status: [ :active, :archived ]
end

# conversation.update! status: 0
conversation.active!
conversation.active? # => true
conversation.status  # => "active"

# conversation.update! status: 1
conversation.archived!
conversation.archived? # => true
conversation.status    # => "archived"

# conversation.update! status: 1
conversation.status = "archived"

# conversation.update! status: nil
conversation.status = nil
conversation.status.nil? # => true
conversation.status      # => nil
#+END_SRC
So what's going on in terms of Ruby meta-programming?

For all the enum values declared for =Conversation=, methods are created in the
following forms. Let's use the model Conversation, column "status", and the enum "active" for this exampl:
|----------------------------------------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| method                                             | description                                                                                                                                                                                                     |
|----------------------------------------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =self.status=                                      | Returns enum *string* value (not symbol, and not *integer* db value)                                                                                                                                            |
| =self.status=<enum_string_value or integer_value>= | Set the status to corresponding enum integer value using either a string, symbol, or integer. If you use an invalid value, you get an ArgumentError. String/symbol is converted to corresponding integer value. |
| =self.active!=                                     | Sets the status enum to "active". This syntax is a bit confusing in that you don't see the attribute you're assigning! ArgumentError if invalid enum.                                                           |
| =self.active?=                                     | equivalent to (=self.status == "active"=), and *not* equivalent to (=self.status == :active=) due to symbols not being equal to strings!                                                                    |
| =Conversation.active=                              | equivalent to =Conversation.where(status: "active")=. Again, it's a bit confusing not to see the column being queried.                                                                                          |
| =Conversation.statuses=                            | Mapping of symbols to ordinal values ={ "active" \=> 0, "archived" \=> 1 }=, of type =HashWithIndifferentAccess=, meaning you can use symbols or strings                                                        |
|----------------------------------------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|

** Default Values for Enums

As the docs say, it's a good idea to use the default value from the database declaration,  like:
#+BEGIN_SRC ruby
create_table :conversations do |t|
  t.column :status, :integer, default: 0, null: false
end
#+END_SRC
More specifically, consider using the first declared status (enum db value zero)
be the default /and/ to not allow null values. I've found that when I've allowed
null values in enums, it makes all my code more complicated. This is an example
of the [[http://robots.thoughtbot.com/rails-refactoring-example-introduce-null-object][Null Object Pattern]]. Nulls in your data and checking for these in your
code will make your life more difficult! Instead, have an enum value for "I
don't know" if that really is a possibility, and make that first value, which is
an index of zero, and you can set that as the database column default.

