source/_posts/2014-10-09-enums-and-queries-in-rails-4-dot-1.html
---
layout: post
title: "Enums and Queries in Rails 4.1, and Understanding Ruby"
date: 2014-10-22 19:23:02 -1000
comments: true
categories: [rails]
keywords: Ruby on Rails, Enums, Ruby
description: Understanding Ruby and how enums work in Rails 4.1.
canonical: https://hackhands.com/ruby-on-enums-queries-and-rails-4-1/
---

<p>
Sometimes when you get puzzled by what Rails is doing, you really just to
understand what Ruby is doing.
</p>

<p>
For example, given this simple code to get an attribute value:
</p>

{% codeblock lang:ruby %}
# return value of some_attribute and foobar
def some_attribute_foobar
  "#{some_attribute} and foobar"
end
{% endcodeblock %}

<p>
Beginners are often stumped by why this code does not set an attribute value:
</p>
{% codeblock lang:ruby %}
# change the value of some_attribute to foobar
def change_some_attribute
  # why doesn't the next line set the some_attribute value to "foobar"?
  some_attribute = "foobar"
  save!
end
{% endcodeblock %}

<p>
What's going on?
</p>

<p>
In the first method, <code>some_attribute</code> is actually a method call which gets the
attribute value of the record. This works in Rails ActiveRecord due to the Ruby
feature of <a href="http://www.ruby-doc.org/core-2.1.3/BasicObject.html">method_missing</a> which allows some code to run when a method is called
that does not exist.
</p>

<p>
In the second method, a local variable called some_attribute is getting
assigned. There is no call to method_missing, as this is a variable assignment!
</p>

<p>
The correct code should have been:
</p>
{% codeblock lang:ruby %}
# change the value of some_attribute to foobar
def change_some_attribute
  self.some_attribute = "foobar"
  save!
end
{% endcodeblock %}

<p>
In this case, we're calling the method <code>some_attribute=</code> on the model instance,
and we get the expected result of assigning an attribute value.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Enums</h2>
<div class="outline-text-2" id="text-1">
<p>
For those not familiar with enums:
</p>

<blockquote>
<p>
An enum type is a special data type that enables for a variable to be a set of
predefined constants. The variable must be equal to one of the values that have
been predefined for it.
</p>
</blockquote>

<p>
Enums, introduced in Rails 4.1, are a place a lot of Ruby magic happens! It's
critical to understand Ruby well in order to understand how to use enums
effectively. Let's suppose we have this simple example, copied over from the
<a href="http://edgeapi.rubyonrails.org/classes/ActiveRecord/Enum.html">Rails docs</a>:
</p>

{% codeblock lang:ruby %}
class Conversation < ActiveRecord::Base
  enum status: [ :active, :archived ]
end

# conversation.update! status: 0
conversation.active!
conversation.active? # => true
conversation.status  # => "active"

# conversation.update! status: 1
conversation.archived!
conversation.archived? # => true
conversation.status    # => "archived"

# conversation.update! status: 1
conversation.status = "archived"

# conversation.update! status: nil
conversation.status = nil
conversation.status.nil? # => true
conversation.status      # => nil
{% endcodeblock %}
<p>
So what's going on in terms of Ruby meta-programming?
</p>

<p>
For all the enum values declared for <code>Conversation</code>, methods are created in the
following forms. Let's use the model Conversation, column "status", and the enum "active" for this exampl:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">method</th>
<th scope="col" class="left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>self.status</code></td>
<td class="left">Returns enum <b>string</b> value (not symbol, and not <b>integer</b> db value)</td>
</tr>

<tr>
<td class="left"><code>self.status=&lt;enum_string_value or integer_value&gt;</code></td>
<td class="left">Set the status to corresponding enum integer value using either a string, symbol, or integer. If you use an invalid value, you get an ArgumentError. String/symbol is converted to corresponding integer value.</td>
</tr>

<tr>
<td class="left"><code>self.active!</code></td>
<td class="left">Sets the status enum to "active". This syntax is a bit confusing in that you don't see the attribute you're assigning! ArgumentError if invalid enum.</td>
</tr>

<tr>
<td class="left"><code>self.active?</code></td>
<td class="left">equivalent to (<code>self.status =</code> "active"<code>), and *not* equivalent to (=self.status =</code> :active=) due to symbols not being equal to strings!</td>
</tr>

<tr>
<td class="left"><code>Conversation.active</code></td>
<td class="left">equivalent to <code>Conversation.where(status: "active")</code>. Again, it's a bit confusing not to see the column being queried.</td>
</tr>

<tr>
<td class="left"><code>Conversation.statuses</code></td>
<td class="left">Mapping of symbols to ordinal values <code>{ "active" \=&gt; 0, "archived" \=&gt; 1 }</code>, of type <code>HashWithIndifferentAccess</code>, meaning you can use symbols or strings</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Default Values for Enums</h3>
<div class="outline-text-3" id="text-1-1">
<p>
As the docs say, it's a good idea to use the default value from the database declaration,  like:
</p>
{% codeblock lang:ruby %}
create_table :conversations do |t|
  t.column :status, :integer, default: 0, null: false
end
{% endcodeblock %}
<p>
More specifically, consider using the first declared status (enum db value zero)
be the default <i>and</i> to not allow null values. I've found that when I've allowed
null values in enums, it makes all my code more complicated. This is an example
of the <a href="http://robots.thoughtbot.com/rails-refactoring-example-introduce-null-object">Null Object Pattern</a>. Nulls in your data and checking for these in your
code will make your life more difficult! Instead, have an enum value for "I
don't know" if that really is a possibility, and make that first value, which is
an index of zero, and you can set that as the database column default.
</p>
</div>
</div>
