source/org_posts/2014-10-09-enums-and-queries-in-rails-4-dot-1.org
** Queries on Enums

The docs say:
#+begin_quote
In rare circumstances you might need to access the mapping directly. The mappings are exposed through a class method with the pluralized attribute name
#+end_quote

#+BEGIN_SRC ruby
Conversation.statuses # => { "active" => 0, "archived" => 1 }
#+END_SRC

*This is not rare! This is critical!*

For example, suppose you want to query where the status is not "archived":

You might be tempted to think that Rails will be smart enough to figure out that 
#+BEGIN_SRC ruby
Conversation.where("status <> ?", "archived")
#+END_SRC

Rails is not smart enough to know that the ? is for status and that is an enum.
So you have to use this syntax:
#+BEGIN_SRC ruby
Conversation.where("status <> ?", Conversation.statuses[:archived])
#+END_SRC

You might be tempted to think that this would work:
#+BEGIN_SRC ruby
Conversation.where.not(status: :archived)
#+END_SRC
That throws an =ArgumentError=. Rails wants an integer and not a symbol, and symbol does
not define =to_i=.

What's worse is this one:
#+BEGIN_SRC ruby
Conversation.where.not(status: "archived")
#+END_SRC

The problem is that ActiveRecord sees that the enum column is of type integer
and calls =#to_i= on the value, so =archived.to_i= *gets converted to zero*. In
fact, *all your enums will get converted to zero!* And if you use the value of
the enum attribute on an ActiveRecord instance (say a Conversation object),
then you're using a string value!

If you're curious what the Rails source is, then take a look here: [[https://github.com/rails/rails/blob/master/activerecord/lib/active_record/type/integer.rb][ActiveRecord::Type::Integer]].

Here's a guaranteed broken bit of code:

#+BEGIN_SRC ruby
# my_conversation.status is a String!
Conversation.where.not(status: my_conversation.status)
#+END_SRC

You'd think that Rails would be clever enough to see that the key maps to an
enum and then check if the comparison value is a String, and then it would
*not* call =to_i= on the String! Instead, we are effectively running this code:

#+BEGIN_SRC ruby
Conversation.where.not(status: 0)
#+END_SRC

An acceptable alternative to the last code example would be:
#+BEGIN_SRC ruby
Conversation.where.not(Conersation.statuses[my_conversation.status])
#+END_SRC

If you left out the =not=, you could also do:
#+BEGIN_SRC ruby
Conversation.send(my_conversation.status)
#+END_SRC

However, I really would like to simply do these, /all of which *DO NOT* work/.:
#+BEGIN_SRC ruby
Conversation.where(status: my_conversation.status)
Conversation.where(status: :archived)
Conversation.where(status: "archived")
#+END_SRC

** Pluck vs Map with Enums
Here's another subtle issue with enums.

Should these two lines of code give the same result or a different result:

#+BEGIN_SRC ruby
statuses_with_map = Conversation.select(:status).where.not(status: nil).distinct.map(&:status)
statuses_with_pluck = Conversation.distinct.where.not(status: nil).pluck(:status)
#+END_SRC

It's worth experimenting with this in the [[http://www.railsonmaui.com/blog/2014/08/17/pry-ruby-and-fun-with-the-hash-constructor/][Pry console]]!

In the first case, with =map=, you get back an Array with 2 strings: =["active",
"archived"]=. In the second case, with =pluck=, you get back an Array with 2
integers: =[0, 1]=.

What's going on here?

In the code where =map= calls the =status= method on each =Conversation= record,
the =status= method converts the database integer value into the corresponding
String value!

In the other code that uses =:pluck=, you get back the raw database value. It's
arguable whether or not Rails should intelligently transform this value into the
string equivalent, since that is what is done in other uses of ActiveRecord.
Changing this would be problematic, as there could be code that depends on
getting back the numerical value.

** =find_or_initialize_by=, oh my!!!

Let's suppose we have this persisted in the database:

#+BEGIN_EXAMPLE
Conversation {
  :id => 18,
  :user => 25            
  :status => "archived" (1 in database)
}
#+END_EXAMPLE

And then we do a =find_or_initialize_by=: 

#+BEGIN_EXAMPLE
[47] (pry) main: 0> conversation = Conversation.find_or_initialize_by(user: 25, status: "archived")
  Conversation Load (4.6ms)  SELECT  "conversations".* FROM "conversations"
    WHERE "conversations"."user_id" = 25
       AND "conversations"."status" = 0 LIMIT 1
#<Conversation:> {
         :id => nil,
    :user_id => 25,
     :status => "archived"
}
#+END_EXAMPLE

We got =nil= for =:id=, meaning that we're creating a new record. Wouldn't you
expect to find the existing record? Well, maybe not given the way that
=ActiveRecord.where= works, per the above discussion.

Next, the status on the new record is created with "archived", which is value 1.
Hmmm....If you look closely above, the query uses
#+BEGIN_EXAMPLE
AND "conversations"."status" = 0
#+END_EXAMPLE

Let's look at another example:

#+BEGIN_EXAMPLE
Conversation {
  :id => 19,
  :user => 26            
  :status => "active" (0 in database)
}
#+END_EXAMPLE

And then we do a =find_or_initialize_by=: 

#+BEGIN_EXAMPLE
[47] (pry) main: 0> conversation = Conversation.find_or_initialize_by(user: 26, status: "active")
  Conversation Load (4.6ms)  SELECT  "conversations".* FROM "conversations"
    WHERE "conversations"."user_id" = 26
      AND "conversations"."status" = 0 LIMIT 1
#<Conversation:> {
         :id => 19,
    :user_id => 26,
     :status => "active"
}
#+END_EXAMPLE

Wow! Is this a source of subtle bugs and some serious yak shaving?

Note, the above applies equally to =ActiveRecord.find_or_create_by=.

It turns out that the Rails methods that allow creation of a record via a Hash
of attributes will convert the enum strings to the proper integer values, but
this is not case when querying!

