source/_posts/2014-10-09-enums-and-queries-in-rails-4-dot-1.html
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Queries on Enums</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The docs say:
</p>
<blockquote>
<p>
In rare circumstances you might need to access the mapping directly. The mappings are exposed through a class method with the pluralized attribute name
</p>
</blockquote>

{% codeblock lang:ruby %}
Conversation.statuses # => { "active" => 0, "archived" => 1 }
{% endcodeblock %}

<p>
<b>This is not rare! This is critical!</b>
</p>

<p>
For example, suppose you want to query where the status is not "archived":
</p>

<p>
You might be tempted to think that Rails will be smart enough to figure out that 
</p>
{% codeblock lang:ruby %}
Conversation.where("status <> ?", "archived")
{% endcodeblock %}

<p>
Rails is not smart enough to know that the ? is for status and that is an enum.
So you have to use this syntax:
</p>
{% codeblock lang:ruby %}
Conversation.where("status <> ?", Conversation.statuses[:archived])
{% endcodeblock %}

<p>
You might be tempted to think that this would work:
</p>
{% codeblock lang:ruby %}
Conversation.where.not(status: :archived)
{% endcodeblock %}
<p>
That throws an <code>ArgumentError</code>. Rails wants an integer and not a symbol, and symbol does
not define <code>to_i</code>.
</p>

<p>
What's worse is this one:
</p>
{% codeblock lang:ruby %}
Conversation.where.not(status: "archived")
{% endcodeblock %}

<p>
The problem is that ActiveRecord sees that the enum column is of type integer
and calls <code>#to_i</code> on the value, so <code>archived.to_i</code> <b>gets converted to zero</b>. In
fact, <b>all your enums will get converted to zero!</b> And if you use the value of
the enum attribute on an ActiveRecord instance (say a Conversation object),
then you're using a string value!
</p>

<p>
If you're curious what the Rails source is, then take a look here: <a href="https://github.com/rails/rails/blob/master/activerecord/lib/active_record/type/integer.rb">ActiveRecord::Type::Integer</a>.
</p>

<p>
Here's a guaranteed broken bit of code:
</p>

{% codeblock lang:ruby %}
# my_conversation.status is a String!
Conversation.where.not(status: my_conversation.status)
{% endcodeblock %}

<p>
You'd think that Rails would be clever enough to see that the key maps to an
enum and then check if the comparison value is a String, and then it would
<b>not</b> call <code>to_i</code> on the String! Instead, we are effectively running this code:
</p>

{% codeblock lang:ruby %}
Conversation.where.not(status: 0)
{% endcodeblock %}

<p>
An acceptable alternative to the last code example would be:
</p>
{% codeblock lang:ruby %}
Conversation.where.not(Conersation.statuses[my_conversation.status])
{% endcodeblock %}

<p>
If you left out the <code>not</code>, you could also do:
</p>
{% codeblock lang:ruby %}
Conversation.send(my_conversation.status)
{% endcodeblock %}

<p>
However, I really would like to simply do these, <i>all of which <b>DO NOT</b> work</i>.:
</p>
{% codeblock lang:ruby %}
Conversation.where(status: my_conversation.status)
Conversation.where(status: :archived)
Conversation.where(status: "archived")
{% endcodeblock %}
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Pluck vs Map with Enums</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Here's another subtle issue with enums.
</p>

<p>
Should these two lines of code give the same result or a different result:
</p>

{% codeblock lang:ruby %}
statuses_with_map = Conversation.select(:status).where.not(status: nil).distinct.map(&:status)
statuses_with_pluck = Conversation.distinct.where.not(status: nil).pluck(:status)
{% endcodeblock %}

<p>
It's worth experimenting with this in the <a href="http://www.railsonmaui.com/blog/2014/08/17/pry-ruby-and-fun-with-the-hash-constructor/">Pry console</a>!
</p>

<p>
In the first case, with <code>map</code>, you get back an Array with 2 strings: <code>["active",
"archived"]</code>. In the second case, with <code>pluck</code>, you get back an Array with 2
integers: <code>[0, 1]</code>.
</p>

<p>
What's going on here?
</p>

<p>
In the code where <code>map</code> calls the <code>status</code> method on each <code>Conversation</code> record,
the <code>status</code> method converts the database integer value into the corresponding
String value!
</p>

<p>
In the other code that uses <code>:pluck</code>, you get back the raw database value. It's
arguable whether or not Rails should intelligently transform this value into the
string equivalent, since that is what is done in other uses of ActiveRecord.
Changing this would be problematic, as there could be code that depends on
getting back the numerical value.
</p>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><code>find_or_initialize_by</code>, oh my!!!</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Let's suppose we have this persisted in the database:
</p>

<pre class="example">
Conversation {
  :id =&gt; 18,
  :user =&gt; 25            
  :status =&gt; "archived" (1 in database)
}
</pre>

<p>
And then we do a <code>find_or_initialize_by</code>: 
</p>

<pre class="example">
[47] (pry) main: 0&gt; conversation = Conversation.find_or_initialize_by(user: 25, status: "archived")
  Conversation Load (4.6ms)  SELECT  "conversations".* FROM "conversations"
    WHERE "conversations"."user_id" = 25
       AND "conversations"."status" = 0 LIMIT 1
#&lt;Conversation:&gt; {
         :id =&gt; nil,
    :user_id =&gt; 25,
     :status =&gt; "archived"
}
</pre>

<p>
We got <code>nil</code> for <code>:id</code>, meaning that we're creating a new record. Wouldn't you
expect to find the existing record? Well, maybe not given the way that
<code>ActiveRecord.where</code> works, per the above discussion.
</p>

<p>
Next, the status on the new record is created with "archived", which is value 1.
Hmmm&#x2026;.If you look closely above, the query uses
</p>
<pre class="example">
AND "conversations"."status" = 0
</pre>

<p>
Let's look at another example:
</p>

<pre class="example">
Conversation {
  :id =&gt; 19,
  :user =&gt; 26            
  :status =&gt; "active" (0 in database)
}
</pre>

<p>
And then we do a <code>find_or_initialize_by</code>: 
</p>

<pre class="example">
[47] (pry) main: 0&gt; conversation = Conversation.find_or_initialize_by(user: 26, status: "active")
  Conversation Load (4.6ms)  SELECT  "conversations".* FROM "conversations"
    WHERE "conversations"."user_id" = 26
      AND "conversations"."status" = 0 LIMIT 1
#&lt;Conversation:&gt; {
         :id =&gt; 19,
    :user_id =&gt; 26,
     :status =&gt; "active"
}
</pre>

<p>
Wow! Is this a source of subtle bugs and some serious yak shaving?
</p>

<p>
Note, the above applies equally to <code>ActiveRecord.find_or_create_by</code>.
</p>

<p>
It turns out that the Rails methods that allow creation of a record via a Hash
of attributes will convert the enum strings to the proper integer values, but
this is not case when querying!
</p>
</div>
</div>
