source/org_posts/2014-10-09-enums-and-queries-in-rails-4-dot-1.org
** Rails Default Accessors For Setting Attributes

You may find it useful to know which Rails methods call the "Default Accessor"
versus just going to the database directly. That makes all the difference in
terms of whether or not you can/should use the string values for enums.

The key thing is that that "Uses Default Accessor" means that *string enums get converted to the correct database integer values.*

| Method                   | Uses Default Accessor (converts string enums to integers!) |
|--------------------------+------------------------------------------------------------|
| =attribute==             | Yes                                                        |
| =write_attribute=        | No                                                         |
| =update_attribute=       | Yes                                                        |
| =attributes==            | Yes                                                        |
| =update=                 | Yes                                                        |
| =update_column=          | No                                                         |
| =update_columns=         | No                                                         |
| =Conversation::update=   | Yes                                                        |
| =Conversation::update_all= | No                                                         |

For more information on this topic, see
1. [[http://www.davidverhasselt.com/set-attributes-in-activerecord/][Different Ways to Set Attributes in ActiveRecord]] by [[https://twitter.com/DavidVerhasselt][@DavidVerhasselt]].
2. [[http://api.rubyonrails.org/classes/ActiveRecord/Base.html][Official API of ActiveRecord::Base]]
3. [[http://api.rubyonrails.org/files/activerecord/README_rdoc.html][Official Readme of Active Record – Object-relational mapping put on rails]].

While these don't mention Rails enums, it's *critical* to understand that enums
create default accessors that do the mapping to and from Strings.

So when you call these methods, the *default accessors* are used:
#+BEGIN_SRC ruby
conversation.status = "archived"
conversation.status = 1
puts conversation.status # prints "archived"
#+END_SRC

So keep in mind when those default accessors are used per the above table.

** Deep Dive: Enum Source

If you look at the Rails [[https://github.com/rails/rails/blob/877ea784e4cd0d539bdfbd15839ae3d28169b156/activerecord/lib/active_record/enum.rb#L82][source code for ActiveRecord::Enum]], you can see this at
line 91, for the setter of the enum (I added some comments):

#+BEGIN_SRC ruby
  _enum_methods_module.module_eval do
    # def status=(value) self[:status] = statuses[value] end
    define_method("#{name}=") { |value|
      if enum_values.has_key?(value) || value.blank?
        # set the db value to the integer value for the enum
        self[name] = enum_values[value]
      elsif enum_values.has_value?(value) # values contains the integer
        self[name] = value
      else
        # enum_values did not have the key or value passed
        raise ArgumentError, "'#{value}' is not a valid #{name}"
      end
    }
#+END_SRC

From this definition, you see that both of these work:
#+BEGIN_SRC ruby
conversation.status = "active"
conversation.status = 0
#+END_SRC


Here's the definition for the getter, which I've edited a bit for illustrative
purposes:
#+BEGIN_SRC ruby
  # def status() statuses.key self[:status] end
  define_method(name) do
    db_value = self[name] # such as 0 or 1
    enum_values.key(db_value) # the key value, like "archived" for db_value 1
  end
#+END_SRC


** Recommendations to the Rails Core Team
In response to this issue, I submitted this github issue:
[[https://github.com/rails/rails/issues/17226][Rails where query should see value is an enum and convert a string #17226]]
1. @Bounga and @rafaelfranca on Github suggest that we can't automatically
   convert enum string values in queries. I think that is true for converting
   cases of a =?= or a named param, but I suspect that a quick map lookup to see
   that the attribute is an enum, and a string is passed, and then converting
   the string value to an integer is the right thing to do for 2 reasons:
   1) This is the sort of "magic" that I expect from Rails.
   2) Existing methods =find_or_initialize_by= and =find_or_create_by= will
      result in obscure bugs when string params are passed for enums.
   However, it's worth considering if all default accessor methods (setters)
   should be consistently be called for purposes of passing values in a map to
   such methods. I would venture that Rails enums are some Rails provided magic,
   and thus they should have a special case. If this shouldn't go into Rails,
   then possibly a gem extension could provide a method like
   =Model.where_with_enum= which would convert a String into the proper
   numerical value for the enum. I'm not a huge fan of the generated Model
   scopes for enums, as *I like to see what database field is being queried
   against.*
2. Aside from putting automatic conversion of the enum hash attributes, I
   recommend we change the automatic conversion of Strings to integers to use
   the stricter =Integer(some_string)= rather than =some_string.to_i=. The
   difference is considerable, =String#to_i= is extremely permissive. Try it in
   a console. With the =to_i= method, any number characters at the beginning of
   the String are converted to an Integer. If the first character is not a
   number, *0 is returned*, which is almost certainly a default enum value.
   Thus, this simple change would make it *extremely* clear when an enum string
   is improperly used. I would guess that this would make some existing code
   crash, but in all circumstances for a valid reason. As to whether this change
   should be done for all integer attributes is a different discussion, as that
   could have backwards compatibility ramifications. This change would require changing the tests in [[https://github.com/rails/rails/blob/master/activerecord/test/cases/types_test.rb][ActiveRecord::ConnectionAdapters::TypesTest]]. For example, this test:
   #+BEGIN_SRC ruby
   assert_equal 0, type.type_cast_from_user('bad') 
   #+END_SRC
   would change to throw an exception, unless the cases are restricted to using
   Integer.new() for enums. It is inconsistent that some type conversions throw
   exceptions, such as converting a symbol to an integer. Whether or not they
   should is much larger issue. In the case of enums, *I definitely believe that proper enum string value should not silently convert to zero every time.*

* Conclusion
I hope this article has convinced you that it's worth understanding Ruby as much
as it is to understand Rails. Additionally, the new Enum feature in 4.1 requires
some careful attention!

Thanks to Hack Hands for supporting the development of this content. You can
find [[https://hackhands.com/ruby-on-enums-queries-and-rails-4-1/][a copy of this article in their blog]]. 
