source/_posts/2014-10-09-enums-and-queries-in-rails-4-dot-1.html
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Rails Default Accessors For Setting Attributes</h3>
<div class="outline-text-3" id="text-1-5">
<p>
You may find it useful to know which Rails methods call the "Default Accessor"
versus just going to the database directly. That makes all the difference in
terms of whether or not you can/should use the string values for enums.
</p>

<p>
The key thing is that that "Uses Default Accessor" means that <b>string enums get converted to the correct database integer values.</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Method</th>
<th scope="col" class="left">Uses Default Accessor (converts string enums to integers!)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>attribute=</code></td>
<td class="left">Yes</td>
</tr>

<tr>
<td class="left"><code>write_attribute</code></td>
<td class="left">No</td>
</tr>

<tr>
<td class="left"><code>update_attribute</code></td>
<td class="left">Yes</td>
</tr>

<tr>
<td class="left"><code>attributes=</code></td>
<td class="left">Yes</td>
</tr>

<tr>
<td class="left"><code>update</code></td>
<td class="left">Yes</td>
</tr>

<tr>
<td class="left"><code>update_column</code></td>
<td class="left">No</td>
</tr>

<tr>
<td class="left"><code>update_columns</code></td>
<td class="left">No</td>
</tr>

<tr>
<td class="left"><code>Conversation::update</code></td>
<td class="left">Yes</td>
</tr>

<tr>
<td class="left"><code>Conversation::update_all</code></td>
<td class="left">No</td>
</tr>
</tbody>
</table>

<p>
For more information on this topic, see
</p>
<ol class="org-ol">
<li><a href="http://www.davidverhasselt.com/set-attributes-in-activerecord/">Different Ways to Set Attributes in ActiveRecord</a> by <a href="https://twitter.com/DavidVerhasselt">@DavidVerhasselt</a>.
</li>
<li><a href="http://api.rubyonrails.org/classes/ActiveRecord/Base.html">Official API of ActiveRecord::Base</a>
</li>
<li><a href="http://api.rubyonrails.org/files/activerecord/README_rdoc.html">Official Readme of Active Record – Object-relational mapping put on rails</a>.
</li>
</ol>

<p>
While these don't mention Rails enums, it's <b>critical</b> to understand that enums
create default accessors that do the mapping to and from Strings.
</p>

<p>
So when you call these methods, the <b>default accessors</b> are used:
</p>
{% codeblock lang:ruby %}
conversation.status = "archived"
conversation.status = 1
puts conversation.status # prints "archived"
{% endcodeblock %}

<p>
So keep in mind when those default accessors are used per the above table.
</p>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Deep Dive: Enum Source</h3>
<div class="outline-text-3" id="text-1-6">
<p>
If you look at the Rails <a href="https://github.com/rails/rails/blob/877ea784e4cd0d539bdfbd15839ae3d28169b156/activerecord/lib/active_record/enum.rb#L82">source code for ActiveRecord::Enum</a>, you can see this at
line 91, for the setter of the enum (I added some comments):
</p>

{% codeblock lang:ruby %}
_enum_methods_module.module_eval do
  # def status=(value) self[:status] = statuses[value] end
  define_method("#{name}=") { |value|
    if enum_values.has_key?(value) || value.blank?
      # set the db value to the integer value for the enum
      self[name] = enum_values[value]
    elsif enum_values.has_value?(value) # values contains the integer
      self[name] = value
    else
      # enum_values did not have the key or value passed
      raise ArgumentError, "'#{value}' is not a valid #{name}"
    end
  }
{% endcodeblock %}

<p>
From this definition, you see that both of these work:
</p>
{% codeblock lang:ruby %}
conversation.status = "active"
conversation.status = 0
{% endcodeblock %}


<p>
Here's the definition for the getter, which I've edited a bit for illustrative
purposes:
</p>
{% codeblock lang:ruby %}
# def status() statuses.key self[:status] end
define_method(name) do
  db_value = self[name] # such as 0 or 1
  enum_values.key(db_value) # the key value, like "archived" for db_value 1
end
{% endcodeblock %}
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">Recommendations to the Rails Core Team</h3>
<div class="outline-text-3" id="text-1-7">
<p>
In response to this issue, I submitted this github issue:
<a href="https://github.com/rails/rails/issues/17226">Rails where query should see value is an enum and convert a string #17226</a>
</p>
<ol class="org-ol">
<li>@Bounga and @rafaelfranca on Github suggest that we can't automatically
convert enum string values in queries. I think that is true for converting
cases of a <code>?</code> or a named param, but I suspect that a quick map lookup to see
that the attribute is an enum, and a string is passed, and then converting
the string value to an integer is the right thing to do for 2 reasons:
<ol class="org-ol">
<li>This is the sort of "magic" that I expect from Rails.
</li>
<li>Existing methods <code>find_or_initialize_by</code> and <code>find_or_create_by</code> will
result in obscure bugs when string params are passed for enums.
</li>
</ol>
<p>
However, it's worth considering if all default accessor methods (setters)
should be consistently be called for purposes of passing values in a map to
such methods. I would venture that Rails enums are some Rails provided magic,
and thus they should have a special case. If this shouldn't go into Rails,
then possibly a gem extension could provide a method like
<code>Model.where_with_enum</code> which would convert a String into the proper
numerical value for the enum. I'm not a huge fan of the generated Model
scopes for enums, as <b>I like to see what database field is being queried
against.</b>
</p>
</li>
<li>Aside from putting automatic conversion of the enum hash attributes, I
recommend we change the automatic conversion of Strings to integers to use
the stricter <code>Integer(some_string)</code> rather than <code>some_string.to_i</code>. The
difference is considerable, <code>String#to_i</code> is extremely permissive. Try it in
a console. With the <code>to_i</code> method, any number characters at the beginning of
the String are converted to an Integer. If the first character is not a
number, <b>0 is returned</b>, which is almost certainly a default enum value.
Thus, this simple change would make it <b>extremely</b> clear when an enum string
is improperly used. I would guess that this would make some existing code
crash, but in all circumstances for a valid reason. As to whether this change
should be done for all integer attributes is a different discussion, as that
could have backwards compatibility ramifications. This change would require changing the tests in <a href="https://github.com/rails/rails/blob/master/activerecord/test/cases/types_test.rb">ActiveRecord::ConnectionAdapters::TypesTest</a>. For example, this test:
{% codeblock lang:ruby %}
assert_equal 0, type.type_cast_from_user('bad') 
{% endcodeblock %}
<p>
would change to throw an exception, unless the cases are restricted to using
Integer.new() for enums. It is inconsistent that some type conversions throw
exceptions, such as converting a symbol to an integer. Whether or not they
should is much larger issue. In the case of enums, <b>I definitely believe that proper enum string value should not silently convert to zero every time.</b>
</p>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Conclusion</h2>
<div class="outline-text-2" id="text-2">
<p>
I hope this article has convinced you that it's worth understanding Ruby as much
as it is to understand Rails. Additionally, the new Enum feature in 4.1 requires
some careful attention!
</p>

<p>
Thanks to Hack Hands for supporting the development of this content. You can
find <a href="https://hackhands.com/ruby-on-enums-queries-and-rails-4-1/">a copy of this article in their blog</a>. 
</p>
</div>
</div>
